# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input())
a = n % 10
n = n//10
b = n % 10+n//10
print(a+b)